[
    {
        "title": "Added chat bubbles",
        "date": "2024-08-02",
        "description": [
            "Added chat bubbles to this log list you're reading rn, so it looks more conversational and less formal.",
            "Had a weird issue with vite targets but was quickly solved.<br>I guess weird issues with vite are to be expected when one has a weird setup like this one."
        ],
        "topics": ["choccymilk", "frontend", "code"]
    },
    {
        "title": "Created object locator service PoC",
        "date": "2024-08-02",
        "description": [
            "The document locator service at work grabs resource paths and resolves a media link for a cloud storage file. This service, inside the monolith, was executed serverside and has horrible performance, and has a lot of problems.",
            "As usual, `Rewriting It In Rust™️` was a great idea, so i added a PoC that i will extend depending on how much \"free\" time i have at work.",
            "For now it correctly resolves the resource, gets the metadata and grabs the media link. The hard parts are ahead; caching, connecting with a metadata source of truth (redis), processing, resizing, etc etc."
        ],
        "topics": ["work", "rust", "code"]
    },
    {
        "title": "Added this page",
        "date": "2024-07-30",
        "description": [
            "Added this _\"logs\"_ / _\"things i have done\"_ page. This is like some microblogging thing but i just recount things i have done so i have a registry of stuff i do.",
            "I usually end up forgetting the small wins, so i think this is a good idea. I will add a link to the page just to remember the button functionality exists:"
        ],
        "link": "/logs/index.html",
        "linkText": "Spin in place",
        "topics": ["choccymilk", "frontend", "code"]
    },
    {
        "title": "Added Topic icons",
        "date": "2024-08-03",
        "description": [
            "Added topic icons on the chat bubbles on this page so each entry is easier to identify. Also moved the permalink button to the same line so it's not confusing."
        ],
        "topics": ["choccymilk", "frontend", "code"]
    },
    {
        "title": "Added Blog List View",
        "date": "2024-08-05",
        "description": [
            "Added the blog list view and implemented the 'tags' taxonomy. Also did some fixes on other parts of the website, and thought about some blogposts I wanna write."
        ],
        "topics": ["choccymilk", "frontend", "code"]
    }
]
